/* 班级 学号 姓名 */

/* ----------------------------------------------------------------------------------

     本文件功能：
     1、放被 hanoi_main.cpp 调用的菜单函数，要求显示各菜单项，读入正确的选项后返回

     本文件要求：
     1、不允许定义外部全局变量（const及#define不在限制范围内）
     2、不允许定义静态全局变量（全局变量的使用准则是：少用、慎用、能不用尽量不用）
     3、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
     4、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------------------------------------------------- */

#include <iostream>
#include <conio.h>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/

void printMenu() {
     cout << "---------------------------------\n"
          "1.基本解\n"
          "2.基本解(步数记录)\n"
          "3.内部数组显示(横向)\n"
          "4.内部数组显示(纵向+横向)\n"
          "5.图形解-预备-画三个圆柱\n"
          "6.图形解-预备-在起始柱上画n个盘子\n"
          "7.图形解-预备-第一次移动\n"
          "8.图形解-自动移动版本\n"
          "9.图形解-游戏版\n"
          "0.退出\n"
          "---------------------------------\n"
          "[请选择:] ";
}

int getMenuChoice() {
     char input;
     while (true) {
          input = _getch();
          if (input >= '0' && input <= '9') {
               cout << input << endl; // 回显输入
               cout << endl; // match with Demo
               return input - '0';
          }
          cin.clear();
          cin.ignore(10000, '\n');
     }

     cout << endl;
     return -1;
}